/**
 * Created by Administrator on 2016/7/19.
 */
var outputdata=["***<没钱赚商店>购物清单***\n"+
"名称：冰红茶，数量：5瓶，单价：5.00(元)，小计：25.00(元)\n"+
"名称：羽毛球，数量：1个，单价：4.00(元)，小计：4.00(元)\n"+
"名称：苹果，数量：2斤，单价：5.50(元)，小计：11.00(元)\n"+
"名称：篮球，数量：1个，单价：98.00(元)，小计：98.00(元)\n"+
"----------------------\n"+
    "总计：138.00(元)\n"+
"**********************"
    ,
"***<没钱赚商店>购物清单***\n"+
"名称：可口可乐，数量：1瓶，单价：3.00(元)，小计：3.00(元)\n"+
"名称：百事可乐，数量：2瓶，单价：3.00(元)，小计：5.70(元)，节省：0.30(元)\n"+
"名称：冰红茶，数量：1瓶，单价：5.00(元)，小计：5.00(元)\n"+
"名称：羽毛球，数量：4个，单价：4.00(元)，小计：16.00(元)\n"+
"----------------------\n"+
    "总计：29.70(元)\n"+
"节省：0.30(元)\n"+
"**********************"
    ,
"***<没钱赚商店>购物清单***\n" +
"名称：脉动，数量：2瓶，单价：4.00(元)，小计：7.60(元)，节省：0.40(元)\n"+
"名称：萨姆奶茶，数量：2瓶，单价：4.00(元)，小计：7.60(元)，节省：0.40(元)\n"+
"名称：冰红茶，数量：5瓶，单价：5.00(元)，小计：25.00(元)\n"+
"----------------------\n"+
    "总计：40.20(元)\n"+
"节省：0.80(元)\n"+
"**********************"

    ,
"***<没钱赚商店>购物清单***\n"+
"名称：可口可乐，数量：4瓶，单价：3.00(元)，小计：9.00(元)\n"+
"名称：百事可乐，数量：2瓶，单价：3.00(元)，小计：5.70(元)，节省：0.30(元)\n"
+"名称：萨姆奶茶，数量：1瓶，单价：4.00(元)，小计：3.80(元)，节省：0.20(元)\n"+
"----------------------\n"+
    "买二送一商品：\n"+
"名称：可口可乐，数量：1瓶\n"+
"----------------------\n"+
"总计：18.50(元)\n"+
"节省：3.50(元)\n"+
"**********************"

]